driver-tests/bpelse/assign/predicates/src/xpathAsPredicate/xpathAsPredicate.wsdl

<?xml version="1.0" encoding="windows-1252"?>
<definitions name="xpathAsPredicate" targetNamespace="http://j2ee.netbeans.org/wsdl/xpathAsPredicate"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/xpathAsPredicate" xmlns:ns="http://xml.netbeans.org/schema/xpathAsPredicate" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/xpathAsPredicate">
            <xsd:import namespace="http://xml.netbeans.org/schema/xpathAsPredicate" schemaLocation="xpathAsPredicate.xsd"/>
        </xsd:schema>
    </types>
    <message name="xpathAsPredicateOperationRequest">
        <part name="part1" element="ns:newElement"/>
    </message>
    <message name="xpathAsPredicateOperationResponse">
        <part name="part1" element="ns:newElement"/>
    </message>
    <portType name="xpathAsPredicatePortType">
        <operation name="xpathAsPredicateOperation">
            <input name="input1" message="tns:xpathAsPredicateOperationRequest"/>
            <output name="output1" message="tns:xpathAsPredicateOperationResponse"/>
        </operation>
    </portType>
    <binding name="xpathAsPredicateBinding" type="tns:xpathAsPredicatePortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="xpathAsPredicateOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="xpathAsPredicateService">
        <port name="xpathAsPredicatePort" binding="tns:xpathAsPredicateBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/xpathAsPredicateService/xpathAsPredicatePort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="xpathAsPredicate">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="xpathAsPredicatePortTypeRole" portType="tns:xpathAsPredicatePortType"/>
    </plnk:partnerLinkType>
</definitions>
