driver-tests/bpelse/assign/predicatesJBI/test/xpathAsPredicate/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xpat="http://xml.netbeans.org/schema/xpathAsPredicate">
  <soapenv:Body>
    <xpat:newElement>
      <!--1 to 5 repetitions:-->
      <xpat:Item>FirstItem</xpat:Item>
      <xpat:Item>SecondItem</xpat:Item>
      <xpat:Item>ThirdItem</xpat:Item>
      <xpat:Item>FourthItem</xpat:Item>
      <xpat:importantItem>2</xpat:importantItem>
    </xpat:newElement>
  </soapenv:Body>
</soapenv:Envelope>