driver-tests/bpelse/assign/predicatesJBI/test/results/xpathAsPredicate/Actual_20130221140056_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <newElement xmlns="http://xml.netbeans.org/schema/xpathAsPredicate" xmlns:msgns="http://j2ee.netbeans.org/wsdl/xpathAsPredicate">
      <Item>FirstItem</Item>
      <Item>ThirdItem</Item>
      <importantItem>1</importantItem>
    </newElement>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>